# BuiltInFailures.SlantedColumnFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SlantedColumnFailures Class
BuiltInFailures Class Members See Also
---
Failures about SlantedColumn.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SlantedColumnFailures
```

Visual Basic
---
```text
Public NotInheritable Class SlantedColumnFailures
```

Visual C++
---
```text
public ref class SlantedColumnFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SlantedColumnFailures
# See Also
BuiltInFailures..::..SlantedColumnFailures Members
Autodesk.Revit.DB Namespace